{"publication": "multi_xscience", "summary": ["Two other generalizations that can be considered are invariants of graphs in 3-manifolds, and invariants associated to other flat connections @cite .", "We will analyze these in future work.", "Among other things, there should be a general relation between flat bundles and links in 3-manifolds on the one hand and finite covers and branched covers on the other hand @cite ."], "text": [["This note is a sequel to our earlier paper of the same title [4] and describes invariants of rational homology 3-spheres associated to acyclic orthogonal local systems.", "Our work is in the spirit of the Axelrod–Singer papers [1], generalizes some of their results, and furnishes a new setting for the purely topological implications of their work."], ["| Recently, Mullins calculated the Casson-Walker invariant of the 2-fold cyclic branched cover of an oriented link in S^3 in terms of its Jones polynomial and its signature, under the assumption that the 2-fold branched cover is a rational homology 3-sphere.", "Using elementary principles, we provide a similar calculation for the general case.", "In addition, we calculate the LMO invariant of the p-fold branched cover of twisted knots in S^3 in terms of the Kontsevich integral of the knot."]], "label": [0, 4]}
{"publication": "multi_xscience", "summary": ["Model Based Dynamic Programming, hereafter referred to as MBDP-1 @cite , is probably the most recent work that addresses the exact same issue as that considered in this paper.", "Both the approach presented in this paper and Brent's MBDP-1 are based on explicit probability models.", "Approaches not based on explicit probability models include those based on information theoretic criteria such as MDL , transitional probability or simple recurrent networks .", "The maximum likelihood approach due to Olivier:SGL68 is probabilistic in the sense that it is geared towards explicitly calculating the most probable segmentation of each block of input utterances.", "However, it is not based on a formal statistical model.", "To avoid needless repetition, we only describe Brent's MBDP-1 below and direct the interested reader at Brent:EPS99 which provides an excellent review of many of the algorithms mentioned above."], "text": [["This paper presents a model-based, unsupervised algorithm for recovering word boundaries in a natural-language text from which they have been deleted.", "The algorithm is derived from a probability model of the source that generated the text.", "The fundamental structure of the model is specified abstractly so that the detailed component models of phonology, word-order, and word frequency can be replaced in a modular fashion.", "The model yields a language-independent, prior probability distribution on all possible sequences of all possible words over a given alphabet, based on the assumption that the input was generated by concatenating words from a fixed but unknown lexicon.", "The model is unusual in that it treats the generation of a complete corpus, regardless of length, as a single event in the probability space.", "Accordingly, the algorithm does not estimate a probability distribution on wordss instead, it attempts to calculate the prior probabilities of various word sequences that could underlie the observed text.", "Experiments on phonemic transcripts of spontaneous speech by parents to young children suggest that our algorithm is more effective than other proposed algorithms, at least when utterance boundaries are given and the text includes a substantial number of short utterances."]], "label": [4, 5, 1, 0]}